public/man/man1/chfn.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - chfn.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - chfn.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>chfn - change real user name and information</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>chfn</strong> [/options/] [/LOGIN/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <strong>chfn</strong> command changes user fullname, office room number, office
phone number, and home phone number information for a users account.
This information is typically printed by *finger*(1) and similar
programs. A normal user may only change the fields for her own account,
subject to the restrictions in /etc/login.defs. (The default
configuration is to prevent users from changing their fullname.) The
superuser may change any field for any account. Additionally, only the
superuser may use the <strong>-o</strong> option to change the undefined portions of
the GECOS field.</p>
<p>
These fields must not contain any colons. Except for the <em>other</em> field,
they should not contain any comma or equal sign. It is also recommended
to avoid non-US-ASCII characters, but this is only enforced for the
phone numbers. The <em>other</em> field is used to store accounting information
used by other applications.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The options which apply to the <strong>chfn</strong> command are:</p>
<p>
<strong>-f</strong>, <strong>–full-name</strong> <em>FULL_NAME</em></p>
<blockquote>
<p>Change the users full name.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–home-phone</strong> <em>HOME_PHONE</em></p>
<blockquote>
<p>Change the users home phone number.</p>
</blockquote>
<p>
<strong>-o</strong>, <strong>–other</strong> <em>OTHER</em></p>
<blockquote>
<p>Change the users other GECOS information. This field is used to store
accounting information used by other applications, and can be changed
only by a superuser.</p>
</blockquote>
<p>
<strong>-r</strong>, <strong>–room</strong> <em>ROOM_NUMBER</em></p>
<blockquote>
<p>Change the users room number.</p>
</blockquote>
<p>
<strong>-R</strong>, <strong>–root</strong> <em>CHROOT_DIR</em></p>
<blockquote>
<p>Apply changes in the <em>CHROOT_DIR</em> directory and use the configuration
files from the <em>CHROOT_DIR</em> directory. Only absolute paths are
supported.</p>
</blockquote>
<p>
<strong>-u</strong>, <strong>–help</strong></p>
<blockquote>
<p>Display help message and exit.</p>
</blockquote>
<p>
<strong>-w</strong>, <strong>–work-phone</strong> <em>WORK_PHONE</em></p>
<blockquote>
<p>Change the users office phone number.</p>
</blockquote>
<p>
If none of the options are selected, <strong>chfn</strong> operates in an interactive
fashion, prompting the user with the current values for all of the
fields. Enter the new value to change the field, or leave the line blank
to use the current value. The current value is displayed between a pair
of <strong>[ ]</strong> marks. Without options, <strong>chfn</strong> prompts for the current user
account.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
CONFIGURATION
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The following configuration variables in /etc/login.defs change the
behavior of this tool:</p>
<p>
<strong>CHFN_RESTRICT</strong> (string)</p>
<blockquote>
<p>This parameter specifies which values in the <em>gecos</em> field of the
<em>etc/passwd file may be changed by regular users using the <strong>chfn</strong>
program. It can be any combination of letters /f</em>, <em>r</em>, <em>w</em>, <em>h</em>, for
Full name, Room number, Work phone, and Home phone, respectively. For
backward compatibility, <em>yes</em> is equivalent to <em>rwh</em> and <em>no</em> is
equivalent to <em>frwh</em>. If not specified, only the superuser can make any
changes. The most restrictive setting is better achieved by not
installing <strong>chfn</strong> SUID.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
FILES
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>/etc/login.defs</p>
<blockquote>
<p>Shadow password suite configuration.</p>
</blockquote>
<p>
/etc/passwd</p>
<blockquote>
<p>User account information.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>*chsh*(1), *login.defs*(5), *passwd*(5).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
